Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_tsi.h
#define    TSI_ANACR_IDAC1_DOUBLE_Pos                             (14U)
#define    TSI_ANACR_IDAC1_DOUBLE_Msk                             (0x1U << TSI_ANACR_IDAC1_DOUBLE_Pos)
#define    TSI_ANACR_IDAC1_DOUBLE                                 TSI_ANACR_IDAC1_DOUBLE_Msk

#define    TSI_ANACR_IDAC2_RANGET_Pos                             (12U)
#define    TSI_ANACR_IDAC2_RANGET_Msk                             (0x3U << TSI_ANACR_IDAC2_RANGET_Pos)
#define    TSI_ANACR_IDAC2_RANGET                                 TSI_ANACR_IDAC2_RANGET_Msk

#define    TSI_ANACR_IDAC1_RANGET_Pos                             (10U)
#define    TSI_ANACR_IDAC1_RANGET_Msk                             (0x3U << TSI_ANACR_IDAC1_RANGET_Pos)
#define    TSI_ANACR_IDAC1_RANGET                                 TSI_ANACR_IDAC1_RANGET_Msk

#define    TSI_ANACR_SHIELD_MOD_Pos                               (8U)
#define    TSI_ANACR_SHIELD_MOD_Msk                               (0x3U << TSI_ANACR_SHIELD_MOD_Pos)
#define    TSI_ANACR_SHIELD_MOD                                   TSI_ANACR_SHIELD_MOD_Msk

#define    TSI_ANACR_RC_BYP_Pos                                   (7U)
#define    TSI_ANACR_RC_BYP_Msk                                   (0x1U << TSI_ANACR_RC_BYP_Pos)
#define    TSI_ANACR_RC_BYP                                       TSI_ANACR_RC_BYP_Msk

#define    TSI_ANACR_CMP_RC_Pos                                   (3U)
#define    TSI_ANACR_CMP_RC_Msk                                   (0xfU << TSI_ANACR_CMP_RC_Pos)
#define    TSI_ANACR_CMP_RC                                       TSI_ANACR_CMP_RC_Msk

#define    TSI_ANACR_CMPHS_Pos                                    (2U)
#define    TSI_ANACR_CMPHS_Msk                                    (0x1U << TSI_ANACR_CMPHS_Pos)
#define    TSI_ANACR_CMPHS                                        TSI_ANACR_CMPHS_Msk

#define    TSI_ANACR_VREFBUF_CFG_Pos                              (0U)
#define    TSI_ANACR_VREFBUF_CFG_Msk                              (0x3U << TSI_ANACR_VREFBUF_CFG_Pos)
#define    TSI_ANACR_VREFBUF_CFG                                  TSI_ANACR_VREFBUF_CFG_Msk

#define    TSI_TEST_IBP_TRIM_Pos                                  (24U)
#define    TSI_TEST_IBP_TRIM_Msk                                  (0x7U << TSI_TEST_IBP_TRIM_Pos)
#define    TSI_TEST_IBP_TRIM                                      TSI_TEST_IBP_TRIM_Msk

#define    TSI_TEST_SENSE_CFG_Pos                                 (20U)
#define    TSI_TEST_SENSE_CFG_Msk                                 (0xfU << TSI_TEST_SENSE_CFG_Pos)
#define    TSI_TEST_SENSE_CFG                                     TSI_TEST_SENSE_CFG_Msk

#define    TSI_TEST_CH_IDLE_CFG_Pos                               (18U)
#define    TSI_TEST_CH_IDLE_CFG_Msk                               (0x1U << TSI_TEST_CH_IDLE_CFG_Pos)
#define    TSI_TEST_CH_IDLE_CFG                                   TSI_TEST_CH_IDLE_CFG_Msk

#define    TSI_TEST_R2D_CFG_Pos                                   (16U)
#define    TSI_TEST_R2D_CFG_Msk                                   (0x3U << TSI_TEST_R2D_CFG_Pos)
#define    TSI_TEST_R2D_CFG                                       TSI_TEST_R2D_CFG_Msk

#define    TSI_TEST_SENSI_VALID_Pos                               (14U)
#define    TSI_TEST_SENSI_VALID_Msk                               (0x1U << TSI_TEST_SENSI_VALID_Pos)
#define    TSI_TEST_SENSI_VALID                                   TSI_TEST_SENSI_VALID_Msk

#define    TSI_ANATEST_VCOMP_DFLT_Pos                             (16U)
#define    TSI_ANATEST_VCOMP_DFLT_Msk                             (0xffU << TSI_ANATEST_VCOMP_DFLT_Pos)
#define    TSI_ANATEST_VCOMP_DFLT                                 TSI_ANATEST_VCOMP_DFLT_Msk

#define    TSI_ANATEST_VCOMP_DFEN_Pos                             (15U)
#define    TSI_ANATEST_VCOMP_DFEN_Msk                             (0x1U << TSI_ANATEST_VCOMP_DFEN_Pos)
#define    TSI_ANATEST_VCOMP_DFEN                                 TSI_ANATEST_VCOMP_DFEN_Msk

#define    TSI_ANATEST_IDAC1_CHG_SWT_Pos                          (14U)
#define    TSI_ANATEST_IDAC1_CHG_SWT_Msk                          (0x1U << TSI_ANATEST_IDAC1_CHG_SWT_Pos)
#define    TSI_ANATEST_IDAC1_CHG_SWT                              TSI_ANATEST_IDAC1_CHG_SWT_Msk

#define    TSI_ANATEST_EXCAP_SEL_Pos                              (12U)
#define    TSI_ANATEST_EXCAP_SEL_Msk                              (0x3U << TSI_ANATEST_EXCAP_SEL_Pos)
#define    TSI_ANATEST_EXCAP_SEL                                  TSI_ANATEST_EXCAP_SEL_Msk

#define    TSI_ANATEST_EXCAP_TESTEN_Pos                           (11U)
#define    TSI_ANATEST_EXCAP_TESTEN_Msk                           (0x1U << TSI_ANATEST_EXCAP_TESTEN_Pos)
#define    TSI_ANATEST_EXCAP_TESTEN                               TSI_ANATEST_EXCAP_TESTEN_Msk

#define    TSI_ANATEST_BIIAS_OUTEN_Pos                            (10U)
#define    TSI_ANATEST_BIIAS_OUTEN_Msk                            (0x1U << TSI_ANATEST_BIIAS_OUTEN_Pos)
#define    TSI_ANATEST_BIIAS_OUTEN                                TSI_ANATEST_BIIAS_OUTEN_Msk

#define    TSI_ANATEST_VCOMP_FB_Pos                               (9U)
#define    TSI_ANATEST_VCOMP_FB_Msk                               (0x1U << TSI_ANATEST_VCOMP_FB_Pos)
#define    TSI_ANATEST_VCOMP_FB                                   TSI_ANATEST_VCOMP_FB_Msk

#define    TSI_ANATEST_IDAC_COMP_MODE_Pos                         (8U)
#define    TSI_ANATEST_IDAC_COMP_MODE_Msk                         (0x1U << TSI_ANATEST_IDAC_COMP_MODE_Pos)
#define    TSI_ANATEST_IDAC_COMP_MODE                             TSI_ANATEST_IDAC_COMP_MODE_Msk

#define    TSI_ANATEST_VREF_BUF_ENT_Pos                           (5U)
#define    TSI_ANATEST_VREF_BUF_ENT_Msk                           (0x1U << TSI_ANATEST_VREF_BUF_ENT_Pos)
#define    TSI_ANATEST_VREF_BUF_ENT                               TSI_ANATEST_VREF_BUF_ENT_Msk

#define    TSI_ANATEST_COMP_ENT_Pos                               (4U)
#define    TSI_ANATEST_COMP_ENT_Msk                               (0x1U << TSI_ANATEST_COMP_ENT_Pos)
#define    TSI_ANATEST_COMP_ENT                                   TSI_ANATEST_COMP_ENT_Msk

#define    TSI_ANATEST_IDAC2_ENT_Pos                              (3U)
#define    TSI_ANATEST_IDAC2_ENT_Msk                              (0x1U << TSI_ANATEST_IDAC2_ENT_Pos)
#define    TSI_ANATEST_IDAC2_ENT                                  TSI_ANATEST_IDAC2_ENT_Msk

#define    TSI_ANATEST_IDAC1_ENT_Pos                              (2U)
#define    TSI_ANATEST_IDAC1_ENT_Msk                              (0x1U << TSI_ANATEST_IDAC1_ENT_Pos)
#define    TSI_ANATEST_IDAC1_ENT                                  TSI_ANATEST_IDAC1_ENT_Msk

