Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_tsi.h
#define    TSI_ANATEST_SIGMA_DELTA_ENT_Pos                        (1U)
#define    TSI_ANATEST_SIGMA_DELTA_ENT_Msk                        (0x1U << TSI_ANATEST_SIGMA_DELTA_ENT_Pos)
#define    TSI_ANATEST_SIGMA_DELTA_ENT                            TSI_ANATEST_SIGMA_DELTA_ENT_Msk

#define    TSI_ANATEST_DEBUG_MODE_Pos                             (0U)
#define    TSI_ANATEST_DEBUG_MODE_Msk                             (0x1U << TSI_ANATEST_DEBUG_MODE_Pos)
#define    TSI_ANATEST_DEBUG_MODE                                 TSI_ANATEST_DEBUG_MODE_Msk

#define    TSI_VREFCRTEST_REF_SEL_Pos                             (27U)
#define    TSI_VREFCRTEST_REF_SEL_Msk                             (0x3U << TSI_VREFCRTEST_REF_SEL_Pos)
#define    TSI_VREFCRTEST_REF_SEL                                 TSI_VREFCRTEST_REF_SEL_Msk

#define    TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Pos                    (26U)
#define    TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk                    (0x1U << TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Pos)
#define    TSI_VREFCRTEST_SHIELD1P0_BYPBUF                        TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk

#define    TSI_VREFCRTEST_VREF1P0_BYPBUF_Pos                      (25U)
#define    TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk                      (0x1U << TSI_VREFCRTEST_VREF1P0_BYPBUF_Pos)
#define    TSI_VREFCRTEST_VREF1P0_BYPBUF                          TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk

#define    TSI_VREFCRTEST_CSD1P0_BYPBUF_Pos                       (24U)
#define    TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk                       (0x1U << TSI_VREFCRTEST_CSD1P0_BYPBUF_Pos)
#define    TSI_VREFCRTEST_CSD1P0_BYPBUF                           TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk

#define    TSI_VREFCRTEST_VREF_CSDCMP_TRIM_Pos                    (16U)
#define    TSI_VREFCRTEST_VREF_CSDCMP_TRIM_Msk                    (0x7fU << TSI_VREFCRTEST_VREF_CSDCMP_TRIM_Pos)
#define    TSI_VREFCRTEST_VREF_CSDCMP_TRIM                        TSI_VREFCRTEST_VREF_CSDCMP_TRIM_Msk

#define    TSI_VREFCRTEST_VREF_SHIELD_TRIM_Pos                    (8U)
#define    TSI_VREFCRTEST_VREF_SHIELD_TRIM_Msk                    (0x7fU << TSI_VREFCRTEST_VREF_SHIELD_TRIM_Pos)
#define    TSI_VREFCRTEST_VREF_SHIELD_TRIM                        TSI_VREFCRTEST_VREF_SHIELD_TRIM_Msk

#define    TSI_VREFCRTEST_VREF_BUF_TRIM_Pos                       (0U)
#define    TSI_VREFCRTEST_VREF_BUF_TRIM_Msk                       (0x7fU << TSI_VREFCRTEST_VREF_BUF_TRIM_Pos)
#define    TSI_VREFCRTEST_VREF_BUF_TRIM                           TSI_VREFCRTEST_VREF_BUF_TRIM_Msk

#define    TSI_EMICR0_SR_CFG0_Pos                                 (0U)
#define    TSI_EMICR0_SR_CFG0_Msk                                 (0xffffffffU << TSI_EMICR0_SR_CFG0_Pos)
#define    TSI_EMICR0_SR_CFG0                                     TSI_EMICR0_SR_CFG0_Msk

#define    TSI_EMICR1_SR_CFG1_Pos                                 (0U)
#define    TSI_EMICR1_SR_CFG1_Msk                                 (0xffffffffU << TSI_EMICR1_SR_CFG1_Pos)
#define    TSI_EMICR1_SR_CFG1                                     TSI_EMICR1_SR_CFG1_Msk

#define    TSI_CKCR_MOD_PRSC_Pos                                  (8U)
#define    TSI_CKCR_MOD_PRSC_Msk                                  (0xffU << TSI_CKCR_MOD_PRSC_Pos)
#define    TSI_CKCR_MOD_PRSC                                      TSI_CKCR_MOD_PRSC_Msk

#define    TSI_CKCR_SSC_FPT_Pos                                   (4U)
#define    TSI_CKCR_SSC_FPT_Msk                                   (0x3U << TSI_CKCR_SSC_FPT_Pos)
#define    TSI_CKCR_SSC_FPT                                       TSI_CKCR_SSC_FPT_Msk

#define    TSI_CKCR_SSCEN_Pos                                     (2U)
#define    TSI_CKCR_SSCEN_Msk                                     (0x1U << TSI_CKCR_SSCEN_Pos)
#define    TSI_CKCR_SSCEN                                         TSI_CKCR_SSCEN_Msk

#define    TSI_CKCR_SNSSEL_Pos                                    (0U)
#define    TSI_CKCR_SNSSEL_Msk                                    (0x1U << TSI_CKCR_SNSSEL_Pos)
#define    TSI_CKCR_SNSSEL                                        TSI_CKCR_SNSSEL_Msk

#define    TSI_PRSSW_PRS_SW_WIDTH_Pos                             (16U)
#define    TSI_PRSSW_PRS_SW_WIDTH_Msk                             (0xfU << TSI_PRSSW_PRS_SW_WIDTH_Pos)
#define    TSI_PRSSW_PRS_SW_WIDTH                                 TSI_PRSSW_PRS_SW_WIDTH_Msk

#define    TSI_PRSSW_PRS_SW_Pos                                   (0U)
#define    TSI_PRSSW_PRS_SW_Msk                                   (0x1fffU << TSI_PRSSW_PRS_SW_Pos)
#define    TSI_PRSSW_PRS_SW                                       TSI_PRSSW_PRS_SW_Msk

#define    TSI_PLLCR_PLL_RTRIM_Pos                                (27U)
#define    TSI_PLLCR_PLL_RTRIM_Msk                                (0x1fU << TSI_PLLCR_PLL_RTRIM_Pos)
#define    TSI_PLLCR_PLL_RTRIM                                    TSI_PLLCR_PLL_RTRIM_Msk

#define    TSI_PLLCR_PLLDB_Pos                                    (16U)
#define    TSI_PLLCR_PLLDB_Msk                                    (0x3ffU << TSI_PLLCR_PLLDB_Pos)
#define    TSI_PLLCR_PLLDB                                        TSI_PLLCR_PLLDB_Msk

#define    TSI_PLLCR_PLL_ICFG_Pos                                 (12U)
#define    TSI_PLLCR_PLL_ICFG_Msk                                 (0xfU << TSI_PLLCR_PLL_ICFG_Pos)
#define    TSI_PLLCR_PLL_ICFG                                     TSI_PLLCR_PLL_ICFG_Msk

#define    TSI_PLLCR_LOCKED_Pos                                   (8U)
#define    TSI_PLLCR_LOCKED_Msk                                   (0x1U << TSI_PLLCR_LOCKED_Pos)
#define    TSI_PLLCR_LOCKED                                       TSI_PLLCR_LOCKED_Msk

#define    TSI_PLLCR_REFPRSC_Pos                                  (1U)
#define    TSI_PLLCR_REFPRSC_Msk                                  (0x7fU << TSI_PLLCR_REFPRSC_Pos)
#define    TSI_PLLCR_REFPRSC                                      TSI_PLLCR_REFPRSC_Msk

#define    TSI_PLLCR_PLLEN_Pos                                    (0U)
#define    TSI_PLLCR_PLLEN_Msk                                    (0x1U << TSI_PLLCR_PLLEN_Pos)
#define    TSI_PLLCR_PLLEN                                        TSI_PLLCR_PLLEN_Msk

#define    TSI_PRSSSC_PRS_SSC_WIDTH_Pos                           (16U)
#define    TSI_PRSSSC_PRS_SSC_WIDTH_Msk                           (0xfU << TSI_PRSSSC_PRS_SSC_WIDTH_Pos)
#define    TSI_PRSSSC_PRS_SSC_WIDTH                               TSI_PRSSSC_PRS_SSC_WIDTH_Msk

