Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_tsi.h
/**
  * @brief    
  * @rmtoll           FL_TSI_SetChannelTX
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetChannelTX(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        SET_BIT(TSIx->CHCFGR0, 1<<channel);
    }
    else if(channel > 31 & channel < 36)
    {
        SET_BIT(TSIx->CHCFGR1, 1<<(channel-32));
    }
}
/**
  * @brief    
  * @rmtoll           FL_TSI_SetChannelRX
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetChannelRX(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        CLEAR_BIT(TSIx->CHCFGR0,1 << channel);
    }
    else if(channel > 31 & channel < 36)
    {
        CLEAR_BIT(TSIx->CHCFGR1, 1<<(channel - 32));
    }
}

/**
  * @brief    
  * @rmtoll           FL_TSI_GetChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35                        

  * @retval   Returned value can be one of the following values:
        State of bit (1 or 0).
        0:RX
        1:TX
  */
__STATIC_INLINE uint32_t FL_TSI_GetChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        return (uint32_t)(READ_BIT(TSIx->CHCFGR0, 1<<channel) == (1<<channel));
    }
    else if(channel > 31 & channel < 36)
    {
        return (uint32_t)(READ_BIT(TSIx->CHCFGR1, 1<<(channel - 32)) == (1<<(channel - 32)));
    }
    else
    {
        return 0;
    }
}

/**
  * @brief    
  * @rmtoll   RAWCNTR    TXSID    FL_TSI_TXChannel
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_TXChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->RAWCNTR, (0x3fU << 24U)) >> 24U);
}

/**
  * @brief    
  * @rmtoll   RAWCNTR    RXSID    FL_TSI_RXChannel
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_RXChannel(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->RAWCNTR, (0x3fU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   RAWCNTR    RAW_COUNT    FL_TSI_ReadRawCount
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadRawCount(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->RAWCNTR, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_ZERO    FL_TSI_WriteScanZeroTime
  * @param    TSIx TSI instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteScanZeroTime(TSI_Type *TSIx, uint32_t time)
{
    MODIFY_REG(TSIx->CCR, (0x7fU << 24U), (time << 24U));
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_ZERO    FL_TSI_ReadScanZeroTime
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadScanZeroTime(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CCR, (0x7fU << 24U)) >> 24U);
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_IDLE    FL_TSI_WriteScanIdleTime
  * @param    TSIx TSI instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteScanIdleTime(TSI_Type *TSIx, uint32_t time)
{
    MODIFY_REG(TSIx->CCR, (0xffU << 16U), (time << 16U));
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_IDLE    FL_TSI_ReadScanIdleTime
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadScanIdleTime(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CCR, (0xffU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_INTV    FL_TSI_WriteScanInterval
  * @param    TSIx TSI instance
  * @param    period 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteScanInterval(TSI_Type *TSIx, uint32_t period)
{
    MODIFY_REG(TSIx->CCR, (0xffU << 8U), (period << 8U));
}

/**
  * @brief    
  * @rmtoll   CCR    SCAN_INTV    FL_TSI_ReadScanInterval
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadScanInterval(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CCR, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   CCR    SMPL_WAIT    FL_TSI_WriteSampleWait
  * @param    TSIx TSI instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteSampleWait(TSI_Type *TSIx, uint32_t time)
{
    MODIFY_REG(TSIx->CCR, (0x7U << 1U), (time << 1U));
}

/**
  * @brief    
  * @rmtoll   CCR    SMPL_WAIT    FL_TSI_ReadSampleWait
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadSampleWait(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CCR, (0x7U << 1U)) >> 1U);
}

/**
  * @brief    
  * @rmtoll   CCR    PRSCLK_EN    FL_TSI_SetSampleClockSource
  * @param    TSIx TSI instance
  * @param    source This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetSampleClockSource(TSI_Type *TSIx, uint32_t source)
{
    MODIFY_REG(TSIx->CCR, TSI_CCR_PRSCLK_EN_Msk, source);
}

/**
  * @brief    
  * @rmtoll   CCR    PRSCLK_EN    FL_TSI_GetSampleClockSource
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetSampleClockSource(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CCR, TSI_CCR_PRSCLK_EN_Msk));
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_WREN    FL_TSI_EnableDMAReq_Write
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableDMAReq_Write(TSI_Type *TSIx)
{
    SET_BIT(TSIx->DMACR, TSI_DMACR_DMA_WREN_Msk);
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_WREN    FL_TSI_DisableDMAReq_Write
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableDMAReq_Write(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->DMACR, TSI_DMACR_DMA_WREN_Msk);
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_WREN    FL_TSI_IsEnabledDMAReq_Write
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledDMAReq_Write(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->DMACR, TSI_DMACR_DMA_WREN_Msk) == TSI_DMACR_DMA_WREN_Msk);
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_RDEN    FL_TSI_EnableDMAReq_Read
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableDMAReq_Read(TSI_Type *TSIx)
{
    SET_BIT(TSIx->DMACR, TSI_DMACR_DMA_RDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_RDEN    FL_TSI_DisableDMAReq_Read
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableDMAReq_Read(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->DMACR, TSI_DMACR_DMA_RDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   DMACR    DMA_RDEN    FL_TSI_IsEnabledDMAReq_Read
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledDMAReq_Read(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->DMACR, TSI_DMACR_DMA_RDEN_Msk) == TSI_DMACR_DMA_RDEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CHCFGR    SNS_DIV    FL_TSI_WriteSampleClockPrescaler
  * @param    TSIx TSI instance
  * @param    psc 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteSampleClockPrescaler(TSI_Type *TSIx, uint32_t psc)
{
    MODIFY_REG(TSIx->SPCFGR, (0xfffU << 20U), (psc << 20U));
}

/**
  * @brief    
  * @rmtoll   CHCFGR    SNS_DIV    FL_TSI_ReadSampleClockPrescaler
  * @param    TSIx TSI instance
  * @retval   A0-A35
  */
__STATIC_INLINE uint32_t FL_TSI_ReadSampleClockPrescaler(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->SPCFGR, (0xfffU << 20U)) >> 20U);
}

/**
  * @brief    
  * @rmtoll   CHCFGR    RES    FL_TSI_SetResolution
  * @param    TSIx TSI instance
  * @param    resolution This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_8B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_9B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_10B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_11B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_12B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_13B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_14B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_15B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_16B
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetResolution(TSI_Type *TSIx, uint32_t resolution)
{
    MODIFY_REG(TSIx->SPCFGR, TSI_CHCFGR_RES_Msk, resolution);
}

/**
  * @brief    
  * @rmtoll   CHCFGR    RES    FL_TSI_GetResolution
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_8B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_9B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_10B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_11B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_12B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_13B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_14B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_15B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_16B
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_8B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_9B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_10B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_11B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_12B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_13B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_14B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_15B
  *           @arg @ref FL_TSI_SAMPLE_RESOLUTION_16B
  */
__STATIC_INLINE uint32_t FL_TSI_GetResolution(TSI_Type *TSIx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TSIx->SPCFGR, TSI_CHCFGR_RES_Msk));
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC_MODE    FL_TSI_SetIDACMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC_MODE_SINGLE
  *           @arg @ref FL_TSI_IDAC_MODE_DUAL
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetIDACMode(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->SPCFGR, TSI_CHCFGR_IDAC_MODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC_MODE    FL_TSI_GetIDACMode
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_IDAC_MODE_SINGLE
  *           @arg @ref FL_TSI_IDAC_MODE_DUAL
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_IDAC_MODE_SINGLE
  *           @arg @ref FL_TSI_IDAC_MODE_DUAL
  */
__STATIC_INLINE uint32_t FL_TSI_GetIDACMode(TSI_Type *TSIx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TSIx->SPCFGR, TSI_CHCFGR_IDAC_MODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC2_CFG    FL_TSI_WriteIDAC2Current
  * @param    TSIx TSI instance
  * @param    current 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteIDAC2Current(TSI_Type *TSIx, uint32_t current)
{
    MODIFY_REG(TSIx->SPCFGR, (0x7fU << 8U), (current << 8U));
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC2_CFG    FL_TSI_ReadIDAC2Current
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  * @retval   A0-A35
  */
__STATIC_INLINE uint32_t FL_TSI_ReadIDAC2Current(TSI_Type *TSIx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TSIx->SPCFGR, (0x7fU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC1_CFG    FL_TSI_WriteIDAC1Current
  * @param    TSIx TSI instance
  * @param    current 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteIDAC1Current(TSI_Type *TSIx, uint32_t current)
{
    MODIFY_REG(TSIx->SPCFGR, (0x7fU << 0U), (current << 0U));
}

/**
  * @brief    
  * @rmtoll   CHCFGR    IDAC1_CFG    FL_TSI_ReadIDAC1Current
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  * @retval   A0-A35
  */
__STATIC_INLINE uint32_t FL_TSI_ReadIDAC1Current(TSI_Type *TSIx, uint32_t channel)
{
    return (uint32_t)(READ_BIT(TSIx->SPCFGR, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   IDACTR    IDAC2_TRIM    FL_TSI_WriteIDAC2TrimValue
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteIDAC2TrimValue(TSI_Type *TSIx, uint32_t trim)
{
    MODIFY_REG(TSIx->IDACTR, (0x1fU << 8U), (trim << 8U));
}

/**
  * @brief    
  * @rmtoll   IDACTR    IDAC2_TRIM    FL_TSI_ReadIDAC2TrimValue
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadIDAC2TrimValue(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->IDACTR, (0x1fU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   IDACTR    IDAC1_TRIM    FL_TSI_WriteIDAC1TrimValue
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteIDAC1TrimValue(TSI_Type *TSIx, uint32_t trim)
{
    MODIFY_REG(TSIx->IDACTR, (0x1fU << 0U), (trim << 0U));
}

/**
  * @brief    
  * @rmtoll   IDACTR    IDAC1_TRIM    FL_TSI_ReadIDAC1TrimValue
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadIDAC1TrimValue(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->IDACTR, (0x1fU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   ANACR    LOWREF_SEL    FL_TSI_SetLowVoltageReference
  * @param    TSIx TSI instance
  * @param    signal This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetLowVoltageReference(TSI_Type *TSIx, uint32_t signal)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_LOWREF_SEL_Msk, signal);
}

/**
  * @brief    
  * @rmtoll   ANACR    LOWREF_SEL    FL_TSI_GetLowVoltageReference
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetLowVoltageReference(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_LOWREF_SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   ANACR    CMP_AZ_BYP    FL_TSI_EnableComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANACR, TSI_ANACR_CMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    CMP_AZ_BYP    FL_TSI_DisableComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANACR, TSI_ANACR_CMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    CMP_AZ_BYP    FL_TSI_IsEnabledComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_CMP_AZ_BYP_Msk) == TSI_ANACR_CMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    HSCMP_AZ_BYP    FL_TSI_EnableHSComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableHSComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANACR, TSI_ANACR_HSCMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    HSCMP_AZ_BYP    FL_TSI_DisableHSComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableHSComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANACR, TSI_ANACR_HSCMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    HSCMP_AZ_BYP    FL_TSI_IsEnabledHSComparatorAutoZeroBypass
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledHSComparatorAutoZeroBypass(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->ANACR, TSI_ANACR_HSCMP_AZ_BYP_Msk) == TSI_ANACR_HSCMP_AZ_BYP_Msk);
}

/**
  * @brief    
  * @rmtoll   ANACR    LES_PCFG    FL_TSI_SetLowEMISwitchPMOS
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetLowEMISwitchPMOS(TSI_Type *TSIx, uint32_t mode)
{
    MODIFY_REG(TSIx->ANACR, TSI_ANACR_LES_PCFG_Msk, mode);
}

