Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_tsi.h
/**
  * @brief    
  * @rmtoll   ANATEST    DEBUG_MODE    FL_TSI_EnableDebugMode
  * @param    TSIx TSI instance
  * @param    mode This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableDebugMode(TSI_Type *TSIx)
{
    SET_BIT(TSIx->ANATEST, TSI_ANATEST_DEBUG_MODE_Msk);
}

/**
  * @brief    
  * @rmtoll   ANATEST    DEBUG_MODE    FL_TSI_DisableDebugMode
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_TSI_DisableDebugMode(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->ANATEST, TSI_ANATEST_DEBUG_MODE_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    REF_SEL    FL_TSI_SetVoltageReference
  * @param    TSIx TSI instance
  * @param    signal This parameter can be one of the following values:
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetVoltageReference(TSI_Type *TSIx, uint32_t signal)
{
    MODIFY_REG(TSIx->VREFCR, TSI_VREFCRTEST_REF_SEL_Msk, signal);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    LOWREF_SEL    FL_TSI_GetLowVoltageReference
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_TSI_GetVoltageReference(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, TSI_VREFCRTEST_REF_SEL_Msk));
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    SHIELD1P0_BYPBUF    FL_TSI_EnableShield1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableShield1p0Bypbuf(TSI_Type *TSIx)
{
    SET_BIT(TSIx->VREFCR, TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    SHIELD1P0_BYPBUF    FL_TSI_DisableShield1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableShield1p0Bypbuf(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->VREFCR, TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    SHIELD1P0_BYPBUF    FL_TSI_IsEnabledShield1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledShield1p0Bypbuf(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk) == TSI_VREFCRTEST_SHIELD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF1P0_BYPBUF    FL_TSI_EnableVref1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableVref1p0Bypbuf(TSI_Type *TSIx)
{
    SET_BIT(TSIx->VREFCR, TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF1P0_BYPBUF    FL_TSI_DisableVref1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableVref1p0Bypbuf(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->VREFCR, TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF1P0_BYPBUF    FL_TSI_IsEnabledVref1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledVref1p0Bypbuf(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk) == TSI_VREFCRTEST_VREF1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    CSD1P0_BYPBUF    FL_TSI_EnableCsd1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableCsd1p0Bypbuf(TSI_Type *TSIx)
{
    SET_BIT(TSIx->VREFCR, TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    CSD1P0_BYPBUF    FL_TSI_DisableCsd1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableCsd1p0Bypbuf(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->VREFCR, TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    CSD1P0_BYPBUF    FL_TSI_IsEnabledCsd1p0Bypbuf
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledCsd1p0Bypbuf(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk) == TSI_VREFCRTEST_CSD1P0_BYPBUF_Msk);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_CSDCMP_TRIM    FL_TSI_WriteVerfCsdCmpTrim
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteVerfCsdCmpTrim(TSI_Type *TSIx, uint32_t trim)
{
    MODIFY_REG(TSIx->VREFCR, (0x7fU << 16U), (trim << 16U));
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_CSDCMP_TRIM    FL_TSI_ReadVerfCsdCmpTrim
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadVerfCsdCmpTrim(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, (0x7fU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_SHIELD_TRIM    FL_TSI_WriteVerfShieldTrim
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteVerfShieldTrim(TSI_Type *TSIx, uint32_t trim)
{
    MODIFY_REG(TSIx->VREFCR, (0x7fU << 8U), (trim << 8U));
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_SHIELD_TRIM    FL_TSI_ReadVerfShieldTrim
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadVerfShieldTrim(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, (0x7fU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_BUF_TRIM    FL_TSI_WriteVerfBufTrim
  * @param    TSIx TSI instance
  * @param    trim 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteVerfBufTrim(TSI_Type *TSIx, uint32_t trim)
{
    MODIFY_REG(TSIx->VREFCR, (0x7fU << 0U), (trim << 0U));
}

/**
  * @brief    
  * @rmtoll   VREFCRTEST    VREF_BUF_TRIM    FL_TSI_ReadVerfBufTrim
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadVerfBufTrim(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->VREFCR, (0x7fU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll           FL_TSI_EnableShieldPullDown
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35      
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableShieldPullDown(TSI_Type *TSIx, uint32_t channel)
{
    if(channel<32)
    {
        SET_BIT(TSIx->SHLDGNDCR0,1<<channel);
    }
    else if(channel>31&channel<36)
    {
        SET_BIT(TSIx->SHLDGNDCR1,1<<(channel-32));
    }
}

/**
  * @brief    
  * @rmtoll           FL_TSI_DisableShieldPullDown
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35      
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableShieldPullDown(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        CLEAR_BIT(TSIx->SHLDGNDCR0, 1<<channel);
    }
    else if(channel > 31 & channel < 36)
    {
        CLEAR_BIT(TSIx->SHLDGNDCR1, 1<<(channel - 32));
    }
}

/**
  * @brief    
  * @rmtoll           FL_TSI_IsEnabledShieldPullDown
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35      
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledShieldPullDown(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        return (uint32_t)(READ_BIT(TSIx->SHLDGNDCR0, 1<<channel) == (1<<channel));
    }
    else if(channel > 31 & channel < 36)
    {
        return (uint32_t)(READ_BIT(TSIx->SHLDGNDCR1, 1<<(channel - 32)) == (1<<(channel - 32)));
    }
    else
    {
        return 0;
    }
}

/**
  * @brief    
  * @rmtoll     FL_TSI_SetPadSlewRateControl
  * @param    TSIx TSI instance
  * @param    pad This parameter can be one of the following values:
  *           @arg @ref FL_TSI_PAD_PE6
  *           @arg @ref FL_TSI_PAD_PE7
  *           @arg @ref FL_TSI_PAD_PE8
  *           @arg @ref FL_TSI_PAD_PE9
  *           @arg @ref FL_TSI_PAD_PF12
  *           @arg @ref FL_TSI_PAD_PF13
  *           @arg @ref FL_TSI_PAD_PF14
  *           @arg @ref FL_TSI_PAD_PF15
  *           @arg @ref FL_TSI_PAD_PC0
  *           @arg @ref FL_TSI_PAD_PC1
  *           @arg @ref FL_TSI_PAD_PC2
  *           @arg @ref FL_TSI_PAD_PC3
  *           @arg @ref FL_TSI_PAD_PC4
  *           @arg @ref FL_TSI_PAD_PC5
  *           @arg @ref FL_TSI_PAD_PC6
  *           @arg @ref FL_TSI_PAD_PC7
  *           @arg @ref FL_TSI_PAD_PC8
  *           @arg @ref FL_TSI_PAD_PC9
  *           @arg @ref FL_TSI_PAD_PC10
  *           @arg @ref FL_TSI_PAD_PC11
  *           @arg @ref FL_TSI_PAD_PC12
  *           @arg @ref FL_TSI_PAD_PC13
  *           @arg @ref FL_TSI_PAD_PC14
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_TSI_DEFAULT
  *           @arg @ref FL_TSI_SLOW
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetPadSlewRateControl(TSI_Type *TSIx, uint32_t pad,uint32_t mode)
{
    if(pad < 256)
    {
        MODIFY_REG(TSIx->EMICR0, ((pad * pad) * (0x3U)), ((pad * pad) * mode));
    }
    else if(pad > 255 & pad < 4194305)
    {
        pad >>= 8;
        MODIFY_REG(TSIx->EMICR1, ((pad * pad) * (0x3U)), ((pad * pad) * mode));
    }
}

/**
  * @brief    
  * @rmtoll     FL_TSI_GetPadSlewRateControl
  * @param    TSIx TSI instance
  * @param    pad This parameter can be one of the following values:
  *           @arg @ref FL_TSI_PAD_PE6
  *           @arg @ref FL_TSI_PAD_PE7
  *           @arg @ref FL_TSI_PAD_PE8
  *           @arg @ref FL_TSI_PAD_PE9
  *           @arg @ref FL_TSI_PAD_PF12
  *           @arg @ref FL_TSI_PAD_PF13
  *           @arg @ref FL_TSI_PAD_PF14
  *           @arg @ref FL_TSI_PAD_PF15
  *           @arg @ref FL_TSI_PAD_PC0
  *           @arg @ref FL_TSI_PAD_PC1
  *           @arg @ref FL_TSI_PAD_PC2
  *           @arg @ref FL_TSI_PAD_PC3
  *           @arg @ref FL_TSI_PAD_PC4
  *           @arg @ref FL_TSI_PAD_PC5
  *           @arg @ref FL_TSI_PAD_PC6
  *           @arg @ref FL_TSI_PAD_PC7
  *           @arg @ref FL_TSI_PAD_PC8
  *           @arg @ref FL_TSI_PAD_PC9
  *           @arg @ref FL_TSI_PAD_PC10
  *           @arg @ref FL_TSI_PAD_PC11
  *           @arg @ref FL_TSI_PAD_PC12
  *           @arg @ref FL_TSI_PAD_PC13
  *           @arg @ref FL_TSI_PAD_PC14
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_PAD_SLEW_RATE_CONTROL_DEFAULT
  *           @arg @ref FL_TSI_PAD_SLEW_RATE_CONTROL_SLOW
  */
__STATIC_INLINE uint32_t FL_TSI_GetPadSlewRateControl(TSI_Type *TSIx, uint32_t pad)
{
    if(pad < 256)
    {
        return (uint32_t)(READ_BIT(TSIx->EMICR0, ((pad * pad) * (0x3U))) / (pad * pad));
    }
    else if(pad > 255 & pad < 4194305)
    {
        pad>>=8;
        return (uint32_t)(READ_BIT(TSIx->EMICR1, ((pad * pad) * (0x3U))) / (pad * pad));
    }
    else
    {
        return 0;
    }
}


/**
  * @brief    
  * @rmtoll           FL_TSI_EnableShieldChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35  
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableShieldChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        SET_BIT(TSIx->SHLDCR0, 1<<channel);
    }
    else if(channel > 31 & channel < 36)
    {
        SET_BIT(TSIx->SHLDCR1, 1<<(channel - 32));
    }
}

/**
  * @brief    
  * @rmtoll           FL_TSI_DisableShieldChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35  
  * @retval   None
  */
__STATIC_INLINE void  FL_TSI_DisableShieldChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        CLEAR_BIT(TSIx->SHLDCR0, 1<<channel);
    }
    else if(channel>31&channel<36)
    {
        CLEAR_BIT(TSIx->SHLDCR1, 1<<(channel - 32));
    }
}

