Daniel-Cheng249/FMSH_AI_Proj/FL_DEMO_Gcc/FM33HT0xxA_DEMO/Drivers/FM33HT0xxA_FL_Driver/Inc/fm33ht0xxa_fl_tsi.h
/**
  * @brief    
  * @rmtoll           FL_TSI_IsEnabledShieldChannel
  * @param    TSIx TSI instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_TSI_CHANNEL_0
              @arg @ref FL_TSI_CHANNEL_1
              @arg @ref FL_TSI_CHANNEL_2
              @arg @ref FL_TSI_CHANNEL_3
              @arg @ref FL_TSI_CHANNEL_4                        
              @arg @ref FL_TSI_CHANNEL_5                        
              @arg @ref FL_TSI_CHANNEL_6                        
              @arg @ref FL_TSI_CHANNEL_7                        
              @arg @ref FL_TSI_CHANNEL_8                        
              @arg @ref FL_TSI_CHANNEL_9                        
              @arg @ref FL_TSI_CHANNEL_10                         
              @arg @ref FL_TSI_CHANNEL_11                        
              @arg @ref FL_TSI_CHANNEL_12                        
              @arg @ref FL_TSI_CHANNEL_13                        
              @arg @ref FL_TSI_CHANNEL_14                                     
              @arg @ref FL_TSI_CHANNEL_15                        
              @arg @ref FL_TSI_CHANNEL_16                        
              @arg @ref FL_TSI_CHANNEL_17                        
              @arg @ref FL_TSI_CHANNEL_18                        
              @arg @ref FL_TSI_CHANNEL_19                        
              @arg @ref FL_TSI_CHANNEL_20                        
              @arg @ref FL_TSI_CHANNEL_21                        
              @arg @ref FL_TSI_CHANNEL_22                        
              @arg @ref FL_TSI_CHANNEL_23                        
              @arg @ref FL_TSI_CHANNEL_24                        
              @arg @ref FL_TSI_CHANNEL_25                        
              @arg @ref FL_TSI_CHANNEL_26                        
              @arg @ref FL_TSI_CHANNEL_27                        
              @arg @ref FL_TSI_CHANNEL_28                        
              @arg @ref FL_TSI_CHANNEL_29                        
              @arg @ref FL_TSI_CHANNEL_30                        
              @arg @ref FL_TSI_CHANNEL_31                        
              @arg @ref FL_TSI_CHANNEL_32                        
              @arg @ref FL_TSI_CHANNEL_33                        
              @arg @ref FL_TSI_CHANNEL_34                        
              @arg @ref FL_TSI_CHANNEL_35  
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledShieldChannel(TSI_Type *TSIx, uint32_t channel)
{
    if(channel < 32)
    {
        return (uint32_t)(READ_BIT(TSIx->SHLDCR0, 1<<channel) == (1<<channel));
    }
    else if(channel > 31 & channel < 36)
    {
        return (uint32_t)(READ_BIT(TSIx->SHLDCR1, 1<<(channel-32)) == (1<<(channel-32)));
    }
    else
    {
        return 0;
    }
}

/**
  * @brief    
  * @rmtoll   CKCR    MOD_PRSC    FL_TSI_WriteModClockPrescaler
  * @param    TSIx TSI instance
  * @param    prsc 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WriteModClockPrescaler(TSI_Type *TSIx, uint32_t prsc)
{
    MODIFY_REG(TSIx->CKCR, (0xffU << 8U), (prsc << 8U));
}

/**
  * @brief    
  * @rmtoll   CKCR    MOD_PRSC    FL_TSI_ReadModClockPrescaler
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadModClockPrescaler(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CKCR, (0xffU << 8U)) >> 8U);
}

/**
  * @brief    
  * @rmtoll   CKCR    SSC_FPT    FL_TSI_SetSSCPointNum
  * @param    TSIx TSI instance
  * @param    point This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SSC_FPT_32
  *           @arg @ref FL_TSI_SSC_FPT_64
  *           @arg @ref FL_TSI_SSC_FPT_128
  *           @arg @ref FL_TSI_SSC_FPT_256
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetSSCPointNum(TSI_Type *TSIx, uint32_t point)
{
    MODIFY_REG(TSIx->CKCR, TSI_CKCR_SSC_FPT_Msk, point);
}

/**
  * @brief    
  * @rmtoll   CKCR    SSC_FPT    FL_TSI_GetSSCPointNum
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SSC_FPT_32
  *           @arg @ref FL_TSI_SSC_FPT_64
  *           @arg @ref FL_TSI_SSC_FPT_128
  *           @arg @ref FL_TSI_SSC_FPT_256
  */
__STATIC_INLINE uint32_t FL_TSI_GetSSCPointNum(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CKCR, TSI_CKCR_SSC_FPT_Msk));
}

/**
  * @brief    
  * @rmtoll   CKCR    SSCEN    FL_TSI_EnableSSCClock
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnableSSCClock(TSI_Type *TSIx)
{
    SET_BIT(TSIx->CKCR, TSI_CKCR_SSCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CKCR    SSCEN    FL_TSI_DisableSSCClock
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisableSSCClock(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->CKCR, TSI_CKCR_SSCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CKCR    SSCEN    FL_TSI_IsEnabledSSCClock
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledSSCClock(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CKCR, TSI_CKCR_SSCEN_Msk) == TSI_CKCR_SSCEN_Msk);
}

/**
  * @brief    
  * @rmtoll   CKCR    SNSSEL    FL_TSI_SetSenseClockSelect
  * @param    TSIx TSI instance
  * @param    clock This parameter can be one of the following values:
  *           @arg @ref FL_TSI_SNSSEL_FMOD
  *           @arg @ref FL_TSI_SNSSEL_PLL_TSI
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetSenseClockSelect(TSI_Type *TSIx, uint32_t clock)
{
    MODIFY_REG(TSIx->CKCR, TSI_CKCR_SNSSEL_Msk, clock);
}

/**
  * @brief    
  * @rmtoll   CKCR    SNSSEL    FL_TSI_GetSenseClockSelect
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_SNSSEL_FMOD
  *           @arg @ref FL_TSI_SNSSEL_PLL_TSI
  */
__STATIC_INLINE uint32_t FL_TSI_GetSenseClockSelect(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->CKCR, TSI_CKCR_SNSSEL_Msk));
}

/**
  * @brief    
  * @rmtoll   PRSSW    PRS_SW_WIDTH    FL_TSI_WritePRSWidth
  * @param    TSIx TSI instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WritePRSWidth(TSI_Type *TSIx, uint32_t width)
{
    MODIFY_REG(TSIx->PRSSW, (0xfU << 16U), (width << 16U));
}

/**
  * @brief    
  * @rmtoll   PRSSW    PRS_SW_WIDTH    FL_TSI_ReadPRSWidth
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadPRSWidth(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PRSSW, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   PRSSW    PRS_SW    FL_TSI_WritePRSCoeff
  * @param    TSIx TSI instance
  * @param    coefficient 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WritePRSCoeff(TSI_Type *TSIx, uint32_t coefficient)
{
    MODIFY_REG(TSIx->PRSSW, (0x1fffU << 0U), (coefficient << 0U));
}

/**
  * @brief    
  * @rmtoll   PRSSW    PRS_SW    FL_TSI_ReadPRSCoeff
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadPRSCoeff(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PRSSW, (0x1fffU << 0U)) >> 0U);
}

/**
  * @brief    
  * @rmtoll   PLLCR    PLLDB    FL_TSI_WritePLLMultiplier
  * @param    TSIx TSI instance
  * @param    multiple 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WritePLLMultiplier(TSI_Type *TSIx, uint32_t multiple)
{
    MODIFY_REG(TSIx->PLLCR, (0x3ffU << 16U), (multiple << 16U));
}

/**
  * @brief    
  * @rmtoll   PLLCR    PLLDB    FL_TSI_GetPLLMultiplier
  * @param    TSIx TSI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_TSI_PLLDB_DB_32
  *           @arg @ref FL_TSI_PLLDB_DB_48
  *           @arg @ref FL_TSI_PLLDB_DB_64
  *           @arg @ref FL_TSI_PLLDB_DB_72
  */
__STATIC_INLINE uint32_t FL_TSI_GetPLLMultiplier(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PLLCR, TSI_PLLCR_PLLDB_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    LOCKED    FL_TSI_IsActiveFlag_PLLReady
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsActiveFlag_PLLReady(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PLLCR, TSI_PLLCR_LOCKED_Msk) == (TSI_PLLCR_LOCKED_Msk));
}

/**
  * @brief    
  * @rmtoll   PLLCR    REFPRSC    FL_TSI_SetPLLPrescaler
  * @param    TSIx TSI instance
  * @param    prsc 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_SetPLLPrescaler(TSI_Type *TSIx, uint32_t prsc)
{
    MODIFY_REG(TSIx->PLLCR, TSI_PLLCR_REFPRSC_Msk, prsc << 1U);
}

/**
  * @brief    
  * @rmtoll   PLLCR    REFPRSC    FL_TSI_GetPLLPrescaler
  * @param    TSIx TSI instance
  * @retval   0-127:
  */
__STATIC_INLINE uint32_t FL_TSI_GetPLLPrescaler(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PLLCR, TSI_PLLCR_REFPRSC_Msk >> 1U));
}

/**
  * @brief    
  * @rmtoll   PLLCR    PLLEN    FL_TSI_EnablePLL
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_EnablePLL(TSI_Type *TSIx)
{
    SET_BIT(TSIx->PLLCR, TSI_PLLCR_PLLEN_Msk);
}

/**
  * @brief    
  * @rmtoll   PLLCR    PLLEN    FL_TSI_DisablePLL
  * @param    TSIx TSI instance
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_DisablePLL(TSI_Type *TSIx)
{
    CLEAR_BIT(TSIx->PLLCR, TSI_PLLCR_PLLEN_Msk);
}

/**
  * @brief    
  * @rmtoll   PLLCR    PLLEN    FL_TSI_IsEnabledPLL
  * @param    TSIx TSI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_TSI_IsEnabledPLL(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PLLCR, TSI_PLLCR_PLLEN_Msk) == TSI_PLLCR_PLLEN_Msk);
}

/**
  * @brief    
  * @rmtoll   PRSSSC    PRS_SSC_WIDTH    FL_TSI_WritePRSSSCWidth
  * @param    TSIx TSI instance
  * @param    width 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WritePRSSSCWidth(TSI_Type *TSIx, uint32_t width)
{
    MODIFY_REG(TSIx->PRSSSC, (0xfU << 16U), (width << 16U));
}

/**
  * @brief    
  * @rmtoll   PRSSSC    PRS_SSC_WIDTH    FL_TSI_ReadPRSSSCWidth
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadPRSSSCWidth(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PRSSSC, (0xfU << 16U)) >> 16U);
}

/**
  * @brief    
  * @rmtoll   PRSSSC    PRS_SSC    FL_TSI_WritePRSSSC
  * @param    TSIx TSI instance
  * @param    coefficient 
  * @retval   None
  */
__STATIC_INLINE void FL_TSI_WritePRSSSC(TSI_Type *TSIx, uint32_t coefficient)
{
    MODIFY_REG(TSIx->PRSSSC, (0x1fffU << 0U), (coefficient << 0U));
}

/**
  * @brief    
  * @rmtoll   PRSSSC    PRS_SSC    FL_TSI_ReadPRSSSC
  * @param    TSIx TSI instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_TSI_ReadPRSSSC(TSI_Type *TSIx)
{
    return (uint32_t)(READ_BIT(TSIx->PRSSSC, (0x1fffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup TSI_FL_EF_Init Initialization and de-initialization functions
  * @{
  */


/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33HT0XXA_FL_TSI_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2024-01-08*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
